In [2]:
import pandas as pd

In [9]:
prices=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [10]:
prices

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
#Display list of indexes
prices.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [14]:
#.iloc to specify that you are slicing by numeric index
prices.iloc[1:3]

b    2
c    3
dtype: int64

In [17]:
#.loc to specify that you are slicing by index label.
prices.loc['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
#numeric index series
prices=pd.Series(range(0,10,2),index=range(1,6))
print(prices.loc[2])
print(prices.iloc[2])

2
4

In [27]:
#series operations
#multiplication of 2 series
prices=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
inventory=pd.Series(range(1,6),index=['b','l','a','c','k'])
prices*inventory

a     3.0
b     2.0
c    12.0
d     NaN
e     NaN
k     NaN
l     NaN
dtype: float64

In [35]:
#conditional series checking
print(prices>2)
print("\nusing loc")
print(prices.loc[prices>2])

a    False
b    False
c     True
d     True
e     True
dtype: bool

using loc
c    3
d    4
e    5
dtype: int64

In [41]:
#mean, median and other arithematic operations
print(prices.mean())
print(prices.median())
print(prices.std())
print(prices.describe())

3.0
3.0
1.5811388300841898
count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [42]:
#.apply method and lambda
discount_price=prices.apply(lambda x: .9*x if x<4 else x)
print(discount_price)

a    0.9
b    1.8
c    2.7
d    4.0
e    5.0
dtype: float64

In [55]:
#exercise 1

prices = pd.Series([1,1,2,3,5],
              index=['apple', 'pear', 'banana', 'mango', 'jackfruit'])

inventory = pd.Series([10, 50, 41, 22],
              index=['pear', 'banana', 'mango', 'apple'])

one_ind = inventory.iloc[1:4:2]
two_less = prices.loc[prices<prices.mean()]
three_onhand = prices*inventory

print(one_ind)
print(two_less)
print(three_onhand['mango'])

print((prices*inventory).loc['mango'])

banana    50
apple     22
dtype: int64
apple     1
pear      1
banana    2
dtype: int64
123.0
123.0

# Pandas Dataframes

In [74]:
#Express Data frames as a dictionary
produce=pd.DataFrame({'price':prices,'inventory':inventory})
print(produce)

           price  inventory
apple          1       22.0
banana         2       50.0
jackfruit      5        NaN
mango          3       41.0
pear           1       10.0

In [63]:
newDf=pd.DataFrame({'priceList':prices})
newDf

           priceList
apple              1
pear               1
banana             2
mango              3
jackfruit          5

In [67]:
import numpy as np

numpydf=pd.DataFrame(np.array([1,2,3,4]).reshape(2,2))

numpydf

   0  1
0  1  2
1  3  4

In [73]:
pdnew=pd.Series(np.array([1,2,3,4]),index=['first','second','third','fourth'])
pdnew

first     1
second    2
third     3
fourth    4
dtype: int64

In [89]:
#Usage of .loc with data frames
produce=pd.DataFrame({'price':prices,'inventory':inventory,'Product':three_onhand})
#for .loc always use key indexes . It can be int or string
print(produce.loc['apple':'mango','price'])

#in case of .iloc it should be always integers for index slicing
print(produce.iloc[1:4:3,2])

#using .iloc to print everything in data frame
print(produce.iloc[1:4:3,:])

apple        1
banana       2
jackfruit    5
mango        3
Name: price, dtype: int64
banana    100.0
Name: Product, dtype: float64
        price  inventory  Product
banana      2       50.0    100.0

In [92]:
#Accessing particular pandas series
produce['Product']

apple         22.0
banana       100.0
jackfruit      NaN
mango        123.0
pear          10.0
Name: Product, dtype: float64

In [100]:
#adding new column. ordering of columns are very important

produce['new_inventory_product']=  produce['inventory'] * produce['price'] *2
#produce['new_inventory_product'] = produce['inventory'] * produce['price']
produce

           price  inventory  Product  inventory_value  new_inventory_product
apple          1       22.0     22.0             22.0                   44.0
banana         2       50.0    100.0            100.0                  200.0
jackfruit      5        NaN      NaN              NaN                    NaN
mango          3       41.0    123.0            123.0                  246.0
pear           1       10.0     10.0             10.0                   20.0

In [102]:
#dropping a column
produce.drop('inventory_value',axis=1)

           price  inventory  Product  new_inventory_product
apple          1       22.0     22.0                   44.0
banana         2       50.0    100.0                  200.0
jackfruit      5        NaN      NaN                    NaN
mango          3       41.0    123.0                  246.0
pear           1       10.0     10.0                   20.0

In [110]:
#controlling 

produce.loc[:,produce.max()<51]

           price  inventory
apple          1       22.0
banana         2       50.0
jackfruit      5        NaN
mango          3       41.0
pear           1       10.0